{"version":"1.0","provider_name":"Jasa Pembuatan Website dan Aplikasi Profesional","provider_url":"https:\/\/sevenmediatech.co.id","author_name":"Ardika Santosa","author_url":"https:\/\/sevenmediatech.co.id\/author\/blog-smt\/","title":"5 Cara jitu startup mendapatkan klien bisnis yang lebih baik","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"ftEBo0Odzr\"><a href=\"https:\/\/sevenmediatech.co.id\/2018\/10\/08\/cara-jitu-startup-mendapatkan-klient\/\">5 Cara jitu startup mendapatkan klien bisnis yang lebih baik<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/sevenmediatech.co.id\/2018\/10\/08\/cara-jitu-startup-mendapatkan-klient\/embed\/#?secret=ftEBo0Odzr\" width=\"600\" height=\"338\" title=\"&#8220;5 Cara jitu startup mendapatkan klien bisnis yang lebih baik&#8221; &#8212; Jasa Pembuatan Website dan Aplikasi Profesional\" data-secret=\"ftEBo0Odzr\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(c,d){\"use strict\";var e=!1,o=!1;if(d.querySelector)if(c.addEventListener)e=!0;if(c.wp=c.wp||{},c.wp.receiveEmbedMessage);else if(c.wp.receiveEmbedMessage=function(e){var t=e.data;if(!t);else if(!(t.secret||t.message||t.value));else if(\/[^a-zA-Z0-9]\/.test(t.secret));else{for(var r,s,a,i=d.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),n=d.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),o=new RegExp(\"^https?:$\",\"i\"),l=0;l<n.length;l++)n[l].style.display=\"none\";for(l=0;l<i.length;l++)if(r=i[l],e.source!==r.contentWindow);else{if(r.removeAttribute(\"style\"),\"height\"===t.message){if(1e3<(s=parseInt(t.value,10)))s=1e3;else if(~~s<200)s=200;r.height=s}if(\"link\"===t.message)if(s=d.createElement(\"a\"),a=d.createElement(\"a\"),s.href=r.getAttribute(\"src\"),a.href=t.value,!o.test(a.protocol));else if(a.host===s.host)if(d.activeElement===r)c.top.location.href=t.value}}},e)c.addEventListener(\"message\",c.wp.receiveEmbedMessage,!1),d.addEventListener(\"DOMContentLoaded\",t,!1),c.addEventListener(\"load\",t,!1);function t(){if(o);else{o=!0;for(var e,t,r,s=-1!==navigator.appVersion.indexOf(\"MSIE 10\"),a=!!navigator.userAgent.match(\/Trident.*rv:11\\.\/),i=d.querySelectorAll(\"iframe.wp-embedded-content\"),n=0;n<i.length;n++){if(!(r=(t=i[n]).getAttribute(\"data-secret\")))r=Math.random().toString(36).substr(2,10),t.src+=\"#?secret=\"+r,t.setAttribute(\"data-secret\",r);if(s||a)(e=t.cloneNode(!0)).removeAttribute(\"security\"),t.parentNode.replaceChild(e,t);t.contentWindow.postMessage({message:\"ready\",secret:r},\"*\")}}}}(window,document);\n<\/script>\n","thumbnail_url":"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2018\/10\/business-startup-entrepreneur-strategy-target-concept-scaled.webp","thumbnail_width":2560,"thumbnail_height":2329,"description":"Bicara tentang startup mungkin sebagian dari kita akan langsung berfikir, jika startup selalu berhubungan dengan bisnis di dunia IT. Tetapi startup itu semua jenis bisnis yang kita miliki pertama kalinya dan bukan hanya mengincar masalah keuntungan, tetapi bagaimana bisa bermanfaat untuk orang lain dan untuk sekitar kita. Tapi tetap saja, dalam sebuah bisnis, klien atau pelanggan sangat dibutuhkan, karena secara tidak langsung klien menjadi salah satu yang bisa menentukan bisnis kita sukses atau tidak. Klien yang lebih baik membuat bisnis yang lebih baik. Tapi bagaimana tepatnya Anda menemukan dan memikat klien \"lebih baik\" ini? Untuk usaha kecil, bekerja dengan klien yang buruk dibandingkan bekerja dengan klien yang baik memiliki keuntungan bisnis yang bersifat transformasional. Bayangkan komunikasi yang responsif, pembayaran yang cepat, dan arus kas yang lebih baik, semuanya berkontribusi pada bisnis yang jauh lebih sehat dan menguntungkan. Lantas, bagaimana tepatnya Anda dapat mengidentifikasi dan menemukan jenis klien bisnis seperti ini? Mari kita simak cara menemukan klien ideal yang membuat bisnis Anda lebih baik di bawah ini.Lakukan Riset untuk Menemukan Klien Ideal AndaPertama-tama, jika saat ini Anda memiliki lebih dari satu klien, pikirkan klien mana yang Anda anggap lebih baik dari yang lain. Gunakan \"klien ideal\" ini sebagai contoh untuk membantu Anda menemukan orang lain seperti mereka. Tanyakan pada diri Anda sendiri mengenai beberapa hal berikut:- Apa yang menjadikan mereka klien ideal Anda?- Apakah karena mereka responsif dan mudah diajak bekerja sama?- Apakah mereka membayar Anda tepat waktu?- Apakah Anda menikmati peluang kerja yang mereka berikan kepada Anda?Masing-masing pertanyaan ini penting untuk dipertimbangkan ketika mendefinisikan klien ideal Anda. Namun, menikmati pekerjaan Anda sama pentingnya dengan klien yang membayar Anda. Misalnya, jika Anda senang merancang situs web untuk bisnis skala kecil hingga menengah dan menemukan bahwa Anda puas bekerja di pasar khusus tersebut, maka Anda akan tahu bahwa Anda tidak menikmati bekerja untuk perusahaan besar.Cara lain untuk menemukan klien ideal Anda adalah mengungkapkan apa yang tidak Anda sukai dari klien. Misalnya, jika Anda bekerja dengan klien yang selalu responsif, tetapi setelah Anda mengirim faktur untuk pembayaran, ia terus-menerus “keluar dari jaringan”, klien impian Anda akan menjadi sebaliknya.Sangat penting untuk melakukan penelitian yang tepat untuk menemukan klien ideal Anda sejak awal. Gunakan periode ini untuk membantu Anda menilai semua klien masa depan (seperti ujian screening) untuk memastikan bahwa klien bisnis potensial ini memenuhi kriteria \"contoh klien ideal\" Anda.Menentukan di mana Klien Anda Menghabiskan Waktu MerekaSebagai pemilik usaha kecil, tahu persis di mana klien ideal Anda menghabiskan waktu mereka sangat penting, untuk mendapatkan klien yang lebih baik. Jika Anda tahu di mana mereka biasa menghabiskan waktu, Anda kemungkinan akan berada dalam posisi yang baik untuk menunjukkan, menarik, menghubungkan, dan menjual layanan Anda kepada mereka. Untuk mencari tahu di mana klien Anda berkumpul, tanyakan pada diri Anda pertanyaan-pertanyaan ini:- Jenis situs web apa yang sering mereka kunjungi?- Platform social media apa yang biasanya mereka gunakan?- Apakah mereka bagian dari grup LinkedIn atau Facebook?- Acara offline apa yang mereka hadiri?Jika Anda seorang pengguna internet aktif, Anda mungkin terkejut melihat betapa mudahnya mendapatkan informasi ini hanya dengan melakukan survei melalui penggunaan alat seperti Google Typeforms.Mulai Membangun Hubungan dengan Klien yang Lebih BaikJadi Anda telah merefleksikan pertanyaan-pertanyaan ini dan menyelesaikan survei tersebut, maka sekarang Anda tahu di mana klien ideal Anda berkumpul, saatnya untuk terhubung dengan mereka dan membangun hubungan! Ada beberapa cara untuk melakukan ini:1. Situs WebJika Anda tahu situs web mana yang sering mereka kunjungi, pertimbangkan untuk menempatkan diri Anda sebagai pemimpin pemikiran di tempat-tempat \"nongkrong\" tersebut. Mulailah dengan menulis konten yang relevan, mendidik, dan informatif tentang topik yang terkait dengan jenis layanan yang Anda tawarkan.Bagaimana cara melakukannya:Jika Anda adalah agen konsultan desain interior yang menyediakan berbagai layanan desain dan Anda tahu klien ideal Anda cenderung menelusuri artikel tentang “bagaimana cara mendesain”, maka Anda dapat menulis postingan di web desain interior terkenal tentang cara mendesain dengan unik dan berbeda dari desainer lain. Jangan lupa sertakan informasi pribadi dan tautan ke web pribadi Anda sehingga jika klien membaca artikel tersebut dan tertarik, mereka dapat dengan mudah menghubungi Anda untuk layanan desain.2. Social MediaSerupa dengan situs web, pastikan Anda aktif di jaringan social media tempat klien ideal Anda aktifBagaimana cara melakukannya:Jika klien lebih aktif di Twitter, maka jadikan Twitter sebagai msocial media utama Anda untuk berinteraksi dan berbagi informasi. Jika Anda bisa, posisikan diri Anda sebagai pemimpin pemikiran di jaringan yang cenderung mereka gunakan. Tetaplah terhubung dengan mereka melalui media sosial tersebut dan bagikan konten yang relevan dengan industri.Berlatih dan Sempurnakan Strategi Anda Menawarkan Proposisi NilaiMenancapkan proposisi nilai perusahaan adalah kunci untuk mengomunikasikan manfaat atau nilai yang Anda tawarkan kepada klien. Semakin baik Anda mengetahui proposisi nilai Anda sendiri, semakin mudah menarik jenis pelanggan yang Anda inginkan, dan menyaring orang-orang yang tidak Anda inginkan.Proposisi nilai yang efektif dapat menyampaikan pesan yang jelas dan ringkas, pesan itu harus menonjolkan nilai unik Anda, menjanjikan manfaat tertentu, dan sering menyertakan testimonial untuk bukti sosial. Seringkali, mereka berisi judul, sub-judul, poin-poin, gambar, dan kadang-kadang bahkan video. Luangkan waktu untuk mengerjakan proposisi Anda dan pastikan untuk memasukkannya ke halaman utama di situs web termasuk halaman beranda dan layanan Anda.Dengan menggunakan lima langkah di atas untuk membangun bisnis, maka Anda akan memperoleh kesempatan untuk memperoleh klien bisnis yang lebih baik. Klien yang lebih baik adalah klien yang sehat, di mana berarti Anda dibayar tepat waktu, memiliki komunikasi yang baik, dan memberi Anda kesempatan untuk tumbuh bersama, membuat bisnis yang lebih baik dalam jangka panjang. Seorang klien yang lebih baik akan membuat arus kas perusahaan menjadi lancar, dan menghindarkan Anda dari risiko kebangkrutan.Nah itu 5 cara jitu startup dalam mendapatkan dan membangun hubungan dengan klien, Langkah yang paling utama sendiri untuk pelaku usaha ialah pembuatan website, dimana website itu sendiri berguana untuk menampilkan informasi profil, produk\/jasa, dan kontak perusahaan\/UKM\/UMKM maupun pribadi ( Jasa pembuatan website profesial )"}