{"version":"1.0","provider_name":"Jasa Pembuatan Website dan Aplikasi Profesional","provider_url":"https:\/\/sevenmediatech.co.id","author_name":"Ardika Santosa","author_url":"https:\/\/sevenmediatech.co.id\/author\/blog-smt\/","title":"Bosan Hidup Di Bumi? Yuk Kita Jadi Asgardian Aja!","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"8HHGmpMfJG\"><a href=\"https:\/\/sevenmediatech.co.id\/2017\/12\/14\/bosan-hidup-di-bumi-yuk-kita-jadi-asgardian-aja\/\">Bosan Hidup Di Bumi? Yuk Kita Jadi Asgardian Aja!<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/sevenmediatech.co.id\/2017\/12\/14\/bosan-hidup-di-bumi-yuk-kita-jadi-asgardian-aja\/embed\/#?secret=8HHGmpMfJG\" width=\"600\" height=\"338\" title=\"&#8220;Bosan Hidup Di Bumi? Yuk Kita Jadi Asgardian Aja!&#8221; &#8212; Jasa Pembuatan Website dan Aplikasi Profesional\" data-secret=\"8HHGmpMfJG\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(c,d){\"use strict\";var e=!1,o=!1;if(d.querySelector)if(c.addEventListener)e=!0;if(c.wp=c.wp||{},c.wp.receiveEmbedMessage);else if(c.wp.receiveEmbedMessage=function(e){var t=e.data;if(!t);else if(!(t.secret||t.message||t.value));else if(\/[^a-zA-Z0-9]\/.test(t.secret));else{for(var r,s,a,i=d.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),n=d.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),o=new RegExp(\"^https?:$\",\"i\"),l=0;l<n.length;l++)n[l].style.display=\"none\";for(l=0;l<i.length;l++)if(r=i[l],e.source!==r.contentWindow);else{if(r.removeAttribute(\"style\"),\"height\"===t.message){if(1e3<(s=parseInt(t.value,10)))s=1e3;else if(~~s<200)s=200;r.height=s}if(\"link\"===t.message)if(s=d.createElement(\"a\"),a=d.createElement(\"a\"),s.href=r.getAttribute(\"src\"),a.href=t.value,!o.test(a.protocol));else if(a.host===s.host)if(d.activeElement===r)c.top.location.href=t.value}}},e)c.addEventListener(\"message\",c.wp.receiveEmbedMessage,!1),d.addEventListener(\"DOMContentLoaded\",t,!1),c.addEventListener(\"load\",t,!1);function t(){if(o);else{o=!0;for(var e,t,r,s=-1!==navigator.appVersion.indexOf(\"MSIE 10\"),a=!!navigator.userAgent.match(\/Trident.*rv:11\\.\/),i=d.querySelectorAll(\"iframe.wp-embedded-content\"),n=0;n<i.length;n++){if(!(r=(t=i[n]).getAttribute(\"data-secret\")))r=Math.random().toString(36).substr(2,10),t.src+=\"#?secret=\"+r,t.setAttribute(\"data-secret\",r);if(s||a)(e=t.cloneNode(!0)).removeAttribute(\"security\"),t.parentNode.replaceChild(e,t);t.contentWindow.postMessage({message:\"ready\",secret:r},\"*\")}}}}(window,document);\n<\/script>\n","thumbnail_url":"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2017\/12\/space-travel-concept-collage-scaled.webp","thumbnail_width":2560,"thumbnail_height":1707,"description":"Asgardia, secara resmi disebut Space Kingdom of Asgardia, adalah proposal pendirian negara yang diumumkan pada tanggal 12 Oktober 2016 oleh Igor Ashurbeyli, pendiri Aerospace International Research Center dan Ketua Komite Luar Angkasa UNESCO. Negara yang diusulkan tersebut dimaksudkan untuk membuka akses ke luar angkasa, bebas dari kendali negara-negara yang ada, untuk diakusi sebagai sebuah negara berdaulat.Diumumkan pada tanggal 12 Oktober 2016, tujuan akhir dari proyek itu adalah untuk menciptakan negara baru yang memungkinkan akses ke luar angkasa, bebas dari kendali negara-negara yang ada. Kerangka hukum ruang angkasa saat ini, Outer Space Treaty mengharuskan pemerintah untuk memberi wewenang dan mengawasi semua kegiatan di luar angkasa, termasuk kegiatan entitas non-pemerintah seperti organisasi komersial dan nirlaba; dengan mencoba menciptakan sebuah negara, orang-orang di balik Asgardia berharap untuk menghindari pembatasan ketat yang dikeluarkan sistem saat ini. \"Asgardia\" dipilih sebagai referensi ke salah satu dari sembilan dunia mitologi Norse yang dihuni oleh para Dewa.Proyek ini pertama kali diumumkan pada Oktober 2016, oleh ilmuwan Rusia, Igor Ashurbeyli, yang menyebut Asgardia sebagai bangsa independen pertama yang beroperasi di ruang angkasa.Dalam 40 jam setelah diumumkan, lebih dari 100.000 orang mendaftarkan kewarganegaraan di situs Asgardia. Siapa pun yang berusia di atas 18 tahun dan memiliki alamat email, apa pun kebangsaannya, gender, ras, agama dan kondisi keuangan, bisa mendaftar. Bekas narapidana juga bisa mendaftar, sepanjang mereka bebas dari dakwaan saat pendaftaran. Saat ini terdapat lebih dari 280.000 pendaftar dari 217 negara dengan mayortas berusia 18 sampai 35 tahun. Indonesia menempati urutan ke tujuh dan dari berbagai kota, termasuk Jakarta, Bandung, Mataram sampai Jayapura. Pendaftar terbanyak adalah dari Turki, diikuti oleh Cina, Amerika Serikat, Brasil dan Inggris.Kehadiran pertama di ruang angkasa akan dilakukan tahun ini dengan mengirimkan satelit melalui wahana ruang angkasa milik NASA yang akan dibawa ke stasiun ruang angkasa, International Space Station, milik badan luar angkasa Amerika Serikat itu. Lena de Winne mengatakan foto-foto atau data dari mereka yang mendaftar akan dibawa serta dalam satelit ini. Dari ISS, baru satelit ini akan diorbit. Namun De Winne belum bisa menyebutkan tanggal pasti karena jadwal peluncuran menunggu dari NASA.Banyak yang menyambut proyek ini dalam berbagai komentar melalui akun Facebook Asgardia, termasuk akun atas nama Vishal Swami yang menulis, \"Asgardia adalah tujuan yang hebat. Saya berterima kasih kepada mereka yang membuat bangsa menyenangkan ini.\" Pengguna lain, Yanaka Putra menulis, \"Saya bergabung karena saya ingin tinggal di ruang angkasa... Apakah ada perkiraan waktu kapan warga Asgardia mulai pindah ke ruang angkasa? Bukan bangsa ruang angkasa bila tidak tinggal di ruang angkasa.\"Seorang spesialis marketing yang mengatur pertemuan bulanan untuk warga Asgardia yang tinggal di Hong Kong, John Spiro, mengatakan data atau barang pribadi yang dikirim ke ruang angkasa ini yang membuatnya tertarik mendaftar.Negara Asgardia merupakan konsep hunian manusia di masa mendatang. Negara tersebut akan menghuni ruang angkasa dan menjadi negara baru yang akan bergabung dengan Perserikatan Bangsa-Bangsa (PBB). Dijelaskan oleh sang penggagas, Igor Ashurbeyli, Asgardia memiliki tiga unsur pokok yakni filosofi, hukum, dan sains\/teknologi."}