{"id":1944,"date":"2017-03-24T10:00:51","date_gmt":"2017-03-24T10:00:51","guid":{"rendered":"https:\/\/v2.sevenmediatech.co.id\/?p=1944"},"modified":"2023-05-05T09:05:04","modified_gmt":"2023-05-05T09:05:04","slug":"tips-meningkatkan-posisi-website-pada-search-engine","status":"publish","type":"post","link":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/","title":{"rendered":"Tips Meningkatkan Posisi Website pada Search Engine"},"content":{"rendered":"\n<p>Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting dengan<\/p>\n\n\n\n<p>baik pada search engine.<\/p>\n\n\n\n<p><strong>Cara Kerja Search Engine<\/strong><\/p>\n\n\n\n<p>Sebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.<\/p>\n\n\n\n<p>Melakukan Pendaftaran (submission)<\/p>\n\n\n\n<p>Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudah<\/p>\n\n\n\n<p>benar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci &#8220;furniture indonesia&#8221; misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :<\/p>\n\n\n\n<p>•&nbsp;<strong>Faktor Internal<\/strong>&nbsp;(berhubungan dengan penulisan content website dan HTML)<\/p>\n\n\n\n<p>•&nbsp;<strong>Faktor Eksternal<\/strong>&nbsp;(berhubungan dengan link popularity)<\/p>\n\n\n\n<p><strong>1. Faktor Internal<\/strong><\/p>\n\n\n\n<p>Dalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag&nbsp;<img alt=\"\">. Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?<\/p>\n\n\n\n<p>Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :<\/p>\n\n\n\n<p>&#8211; mp3<\/p>\n\n\n\n<p>&#8211; free mp3 downloads<\/p>\n\n\n\n<p>&#8211; free mp3<\/p>\n\n\n\n<p>&#8211; free mp3 music download<\/p>\n\n\n\n<p>&#8211; mp3 downloads<\/p>\n\n\n\n<p>&#8211; mp3 players<\/p>\n\n\n\n<p>&#8211; mp3 midi<\/p>\n\n\n\n<p>&#8211; free mp3 music<\/p>\n\n\n\n<p>&#8211; free mp3s<\/p>\n\n\n\n<p>&#8211; mp3 player<\/p>\n\n\n\n<p>&#8230;<\/p>\n\n\n\n<p>Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.<\/p>\n\n\n\n<p><strong>2. Faktor Eksternal<\/strong><\/p>\n\n\n\n<p>Seperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,<\/p>\n\n\n\n<p>berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijau<\/p>\n\n\n\n<p>dengan nilai antara 0 &#8211; 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.<\/p>\n\n\n\n<p>Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?<\/p>\n\n\n\n<p>Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips &amp; trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.<\/p>\n\n\n\n<p>Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag&nbsp;<a>.<\/a><\/p>\n\n\n\n<p>Contohnya :&nbsp;<a href=\"http:\/\/sevenmediateknologi.com\/\">Situs Website Murah Indonesia<\/a><\/p>\n\n\n\n<p>Pada contoh diatas, kalimat &#8220;Situs Website Murah Indonesia&#8221; juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword &#8220;Website Murah&#8221; atau &#8220;Situs Website Murah Indonesia&#8221; dan juga &#8220;Situs Website Murah Indonesia&#8221;.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":2733,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[21],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.6 (Yoast SEO v21.5) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Tips Meningkatkan Posisi Website pada Search Engine - Jasa Pembuatan Website dan Aplikasi Profesional<\/title>\n<meta name=\"description\" content=\"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci &quot;furniture indonesia&quot; misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips &amp; trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat &quot;Situs Website Murah Indonesia&quot; juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword &quot;Website Murah&quot; atau &quot;Situs Website Murah Indonesia&quot; dan juga &quot;Situs Website Murah Indonesia&quot;.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Tips Meningkatkan Posisi Website pada Search Engine\" \/>\n<meta property=\"og:description\" content=\"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci &quot;furniture indonesia&quot; misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips &amp; trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat &quot;Situs Website Murah Indonesia&quot; juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword &quot;Website Murah&quot; atau &quot;Situs Website Murah Indonesia&quot; dan juga &quot;Situs Website Murah Indonesia&quot;.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\" \/>\n<meta property=\"og:site_name\" content=\"Jasa Pembuatan Website dan Aplikasi Profesional\" \/>\n<meta property=\"article:published_time\" content=\"2017-03-24T10:00:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-05-05T09:05:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2017\/03\/pexels-oleksandr-pidvalnyi-9822732-scaled.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1707\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Ardika Santosa\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\"},\"author\":{\"name\":\"Ardika Santosa\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/f5fa5fc6cabf8b2c7341442e4834aa61\"},\"headline\":\"Tips Meningkatkan Posisi Website pada Search Engine\",\"datePublished\":\"2017-03-24T10:00:51+00:00\",\"dateModified\":\"2023-05-05T09:05:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\"},\"wordCount\":1478,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/#organization\"},\"articleSection\":[\"Blog\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\",\"url\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\",\"name\":\"Tips Meningkatkan Posisi Website pada Search Engine - Jasa Pembuatan Website dan Aplikasi Profesional\",\"isPartOf\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/#website\"},\"datePublished\":\"2017-03-24T10:00:51+00:00\",\"dateModified\":\"2023-05-05T09:05:04+00:00\",\"description\":\"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci \\\"furniture indonesia\\\" misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips & trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat \\\"Situs Website Murah Indonesia\\\" juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword \\\"Website Murah\\\" atau \\\"Situs Website Murah Indonesia\\\" dan juga \\\"Situs Website Murah Indonesia\\\".\",\"breadcrumb\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/sevenmediatech.co.id\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Tips Meningkatkan Posisi Website pada Search Engine\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#website\",\"url\":\"https:\/\/sevenmediatech.co.id\/\",\"name\":\"Jasa Pembuatan Website dan Aplikasi Profesional\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/sevenmediatech.co.id\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#organization\",\"name\":\"CV. Seven Media Technology\",\"url\":\"https:\/\/sevenmediatech.co.id\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2023\/03\/LOGO-SMT-New-e1678874347286.png\",\"contentUrl\":\"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2023\/03\/LOGO-SMT-New-e1678874347286.png\",\"width\":300,\"height\":85,\"caption\":\"CV. Seven Media Technology\"},\"image\":{\"@id\":\"https:\/\/sevenmediatech.co.id\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/f5fa5fc6cabf8b2c7341442e4834aa61\",\"name\":\"Ardika Santosa\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b4cc548707cb0126e275bca86d1eed70?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b4cc548707cb0126e275bca86d1eed70?s=96&d=mm&r=g\",\"caption\":\"Ardika Santosa\"},\"sameAs\":[\"http:\/\/-\"],\"url\":\"https:\/\/sevenmediatech.co.id\/author\/blog-smt\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Tips Meningkatkan Posisi Website pada Search Engine - Jasa Pembuatan Website dan Aplikasi Profesional","description":"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci \"furniture indonesia\" misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips & trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat \"Situs Website Murah Indonesia\" juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword \"Website Murah\" atau \"Situs Website Murah Indonesia\" dan juga \"Situs Website Murah Indonesia\".","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/","og_locale":"en_US","og_type":"article","og_title":"Tips Meningkatkan Posisi Website pada Search Engine","og_description":"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci \"furniture indonesia\" misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips & trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat \"Situs Website Murah Indonesia\" juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword \"Website Murah\" atau \"Situs Website Murah Indonesia\" dan juga \"Situs Website Murah Indonesia\".","og_url":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/","og_site_name":"Jasa Pembuatan Website dan Aplikasi Profesional","article_published_time":"2017-03-24T10:00:51+00:00","article_modified_time":"2023-05-05T09:05:04+00:00","og_image":[{"width":2560,"height":1707,"url":"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2017\/03\/pexels-oleksandr-pidvalnyi-9822732-scaled.webp","type":"image\/jpeg"}],"author":"Ardika Santosa","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#article","isPartOf":{"@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/"},"author":{"name":"Ardika Santosa","@id":"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/f5fa5fc6cabf8b2c7341442e4834aa61"},"headline":"Tips Meningkatkan Posisi Website pada Search Engine","datePublished":"2017-03-24T10:00:51+00:00","dateModified":"2023-05-05T09:05:04+00:00","mainEntityOfPage":{"@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/"},"wordCount":1478,"commentCount":0,"publisher":{"@id":"https:\/\/sevenmediatech.co.id\/#organization"},"articleSection":["Blog"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/","url":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/","name":"Tips Meningkatkan Posisi Website pada Search Engine - Jasa Pembuatan Website dan Aplikasi Profesional","isPartOf":{"@id":"https:\/\/sevenmediatech.co.id\/#website"},"datePublished":"2017-03-24T10:00:51+00:00","dateModified":"2023-05-05T09:05:04+00:00","description":"Search engine adalah salah satu fasilitas vital dari internet untuk menjelajahi lautan informasi yang begitu luas. Bayangkan saja, hanya dalam waktu beberapa detik ia dapat menyuguhkan ribuan bahkan jutaan alamat web (URL) yang memuat informasi berkaitan dengan kata kunci (keyword) yang Anda cari. Bisa Anda bayangkan, berapa juta orang yang mengakses Google setiap harinya, dan berapa juta keyword yang harus dilayani selama 24 jam non stop. Setiap user pada umumnya bertujuan mencari informasi yang mereka butuhkan secepat mungkin. Jika Anda saat ini telah memiliki website, atau baru saja menyelesaikan sebuah website tentunya ingin agar informasi yang Anda sediakan di web mudah dicari orang. Sehingga yang perlu Anda ketahui sekarang adalah bagaimana mengoptimalkan website Anda agar dapat terlisting denganbaik pada search engine.Cara Kerja Search EngineSebelum mendaftarkan website ke search engine, ada baiknya kalau Anda mengetahui sekilas tentang cara kerjanya. Search engine merupakan sebuah sistem database yang dirancang untuk meng-index alamat-alamat internet (URL, FTP, dll). Untuk melaksanakan tugasnya ini, search engine memiliki program khusus yang biasanya disebut spider, bot, atau crawler. Pada saat Anda mendaftarkan sebuah alamat web (URL), spider dari search engine akan menerima dan menganalisa URL tersebut. Dengan algoritma tertentu, spider akan memutuskan apakah web yang anda daftarkan layak diterima atau tidak. Jika layak, spider akan menambahkan URL tersebut ke sistem database mereka. Namun jika tidak, terpaksa Anda harus bersabar dan mengulangi pendaftaran dalam periode tertentu. Kecepatan crawler setiap search engine berbeda-beda. Jadi jika Anda mendaftarkan URL sekarang, kemungkinan baru bisa dilisting dalam 2 minggu hingga 2 bulan. Ini disebabkan karena ada ribuan URL baru yang mendaftar setiap harinya. Google.com dan AllTheWeb.com adalah dua search engine yang memiliki kapasitas crawler terbesar saat ini.Melakukan Pendaftaran (submission)Bagaimana melakukan pendaftaran ? Gampang, Anda tinggal mengisi form pendaftaran URL yang disediakan masing-masing search engine. Misalnya untuk Google, form pendaftarannya ada di http:\/\/www.google.com\/addurl.html. Setelah itu tunggu beberapa minggu dan lakukan pengecekan apakah website Anda sudah terlisting atau tidak. Caranya, masuk ke situs search engine yang bersangkutan kemudian ketikkan domain Anda sebagai kata kunci, misalnya sevenmediateknologi.com. Jika URL Anda muncul pada hasil pencarian (search result), berarti website Anda sudah terdaftar. Bagaimana jika tidak muncul ? Ada dua kemungkinan penyebab. Pertama, karena crawler search engine memang belum sempat berkunjung dan membaca isi (content) dari web Anda. Kedua, crawler sudah berkunjung namun tidak dapat membaca content karena sesuatu hal, misalnya pada saat web server Anda down atau kelebihan traffic. Pada kasus kedua, search engine biasanya akan berusaha membaca ulang URL tersebut dalam jangka waktu tertentu, namun cara terbaik adalah melakukan pendaftaran ulang apabila website Anda sudahbenar-benar siap. Sekarang kita asumsikan pendaftaran website Anda sudah berhasil, apakah itu sudah cukup ? Tentu saja tidak, Anda perlu melakukan pengujian berikutnya. Coba ketikkan keyword atau frase umum yang berhubungan dengan isi website. Misalnya jika website Anda menawarkan produk furniture khas Indonesia, cobalah cari dengan kata kunci \"furniture indonesia\" misalnya. Jika website Anda muncul di halaman pertama atau kedua, itu sudah bagus. Namun jika website Anda muncul di halaman-halaman belakang, janganlah berharap traffic terlalu banyak. Sangat kecil kemungkinan visitor akan dapat menemukan URL Anda. Mau tidak mau, website Anda harus berjuang memperebutkan posisi 20 besar dari ratusan bahkan jutaan website pesaing. Teknik Optimalisasi Search Engine Dalam bahasa Inggris disebut Search Engine Optimization (SEO), adalah cara yang harus ditempuh apabila website Anda tidak berhasil menduduki posisi 20 besar untuk keyword yang diharapkan. Ada dua faktor utama yang harus diperhatikan pada proses SEO, yaitu :• Faktor Internal (berhubungan dengan penulisan content website dan HTML)• Faktor Eksternal (berhubungan dengan link popularity)1. Faktor InternalDalam menentukan rangking, search engine sangat memperhatikan content website sebagai salah satu acuan untuk menentukan tingkat relevansi. Halaman web yang yang desainnya full image, hanya terdiri atas gambar dan flash serta tidak menyertakan teks biasa, sangat sulit dibaca oleh search engine. Walaupun Google saat ini sudah mulai menerapkan teknologi AI (Artificial Intelegence), tetap saja belum bisa membaca makna dari sebuah gambar. Maka dari itu content berupa teks murni wajib dipakai agar website Anda mudah dilisting. Dalam menyusun content teks, usahakan agar kata kunci atau keyword yang Anda harapkan terpakai pada kalimat-kalimat dalam teks tersebut. Anggap saja keyword tersebut merupakan topik utama. Dan jika Anda punya sedikit pengetahuan tentang HTML, tempatkan keyword pada tag dan pada attribut ALT dalam tag . Penggunaan keyword yang dimaksud disini adalah penggunaan dalam batas yang wajar dengan catatan kalimat masih enak untuk dibaca. Bagaimana menentukan keyword yang tepat untuk website Anda ? Bagaimana kita bisa mengetahui sebuah keyword yang banyak dicari orang ?Jika Anda mengoptimalkan website untuk keyword salah bisa berakibat fatal. Meskipun website Anda berada di posisi paling atas pada halaman pertama, tetap saja tidak berguna sebab keyword yang Anda optimalkan tidak pernah dicari orang. Salah satu cara untuk mengatasi masalah ini dengan menggunakan alat bantu seperti yang disediakan WordTracker.com. WordTracker.com memiliki database keyword-keyword populer berdasarkan data dari beberapa search engine utama. Anda tinggal mengetikkan topik dari content website Anda, dan dalam beberapa saat WordTracker bisa memberikan keyword-keyword yang berhubungan dengan topik tersebut. Sebagai contoh, penulis memasukkan kata MP3 dan WordTracker bisa memberikan alternatif keyword seperti ini :- mp3- free mp3 downloads- free mp3- free mp3 music download- mp3 downloads- mp3 players- mp3 midi- free mp3 music- free mp3s- mp3 player...Layanan dari WordTracker ini memang tidak disediakan gratis, namun Anda bisa memanfaatkan Trial-nya. Faktor lain yang perlu Anda perhatikan adalah jangan sampai ada broken link atau javascript error pada website Anda. Faktor ini juga akan menjadi pertimbangan search engine untuk menentukan rangking.2. Faktor EksternalSeperti yang penulis jelaskan sebelumnya, faktor internal lebih berkaitan dengan hal-hal yang ada dalam sebuah website. Faktor internal sangat mudah dimanipulasi, sehingga search engine tidak mungkin menggunakannya 100% sebagai acuan untuk menghasilkan hasil pencarian yang berkualitas. Manipulasi yang dimaksud adalah spamming, seperti penulisan content menggunakan keyword yang diulang-ulang secara berlebihan, penulisan teks yang warnanya sama dengan warna background sehingga pengunjung tidak dapat membacanya. Hal-hal semacam ini tujuannya tidak lain untuk mengecoh crawler. Untuk mengatasi masalah ini, search engine menggunakan faktor eksternal sebagai acuan relevansi antara content website dan keyword. Faktor yang dimaksud adalah link popularity, yaitu banyaknya link dari website lain yang mengarah ke website Anda. Kita ambil contoh situs sevenmediateknologi.com. Karena isinya yang menarik dan bermanfaat, maka banyak pemilik website lain yang memasang link mengarah ke sevenmediateknologi.com, kita anggap saja jumlahnya 100 link. Karena 100 link ini berasal dari luar domain sevenmediateknologi.com, maka nilai link inilah yang diperhitungkan oleh search engine. Semakin banyak link dari luar,berarti nilai link popularity-nya semakin besar. Menurut anggapan search engine, semakin banyak sebuah website di-link, semakin baik pula content yang dimiliki. Link popularity sudah umum dipakai acuan oleh search engine. Salah satu pelopornya adalah Google yang saat ini menjangkau lebih dari 70% pengguna internet di seluruh dunia. Oleh Google, teknologi ini mereka sebut PageRank. Anda bisa melihat nilai PageRank sebuah website dengan menginstall Google Toolbar yang ada di : http:\/\/toolbar.google.com (saat ini hanya untuk browser Internet Explorer). PageRank ditunjukkan oleh bar berwarna hijaudengan nilai antara 0 - 10. Semakin besar nilai PageRank suatu situs, semakin baik pula posisinya di Google.Namun perhitungan link popularity tidak hanya melihat kuantitas semata, melainkan kualitas link juga sangat diperhitungkan. Contohnya jika website Anda di-link oleh Yahoo, nilai link popularity-nya bisa lebih besar daripada di-link oleh 100 website pribadi. Dan sekali lagi, Google menganggap link dari sebuah website dengan nilai PageRank 8 jauh lebih baik dari 5 website yang hanya memiliki PageRank 1. Pertanyaannya sekarang, bagaimana cara mengumpulkan link untuk website Anda ?Secara alami link akan didapat jika website Anda memiliki sesuatu yang berguna bagi pengunjung. Jika kita hendak memasang link ke website lain, tentu kita ingin menunjukkan suatu informasi untuk pengunjung situs kita. Tidak mungkin memasang link hanya untuk iseng, atau tanpa tujuan. Contohnya, jika Anda memiliki sebuah toko online dengan produk kamera digital, hendaknya Anda tidak hanya menampilkan informasi mengenai harga dan kemampuan produk saja. Buatlah halaman khusus yang berisi tips & trik untuk merawat kamera misalnya. Tentu informasi seperti ini akan sangat berguna bagi pengunjung Anda.Cara kedua dengan melakukan barter link (link exchange) secara manual. Anda bisa menghubungi webmaster dari situs-situs yang memiliki informasi berkaitan dengan website Anda. Tawarkan kepada mereka kerjasama melalui barter link, dan terangkan apa keuntungan yang akan mereka dapat. Jika Anda bingung mencari partner, Anda bisa memanfaatkan Google untuk melacak link yang mengarah ke website pesaing. Caranya ketik link: diikuti dengan nama domain yang dicari. Contoh link: www.sevenmediateknologi.com, maka Google akan menampilkan link-link dari website lain yang mengarah ke sevenmediateknologi.com. Masih berkaitan dengan link, tidak semua jenis link bisa meningkatkan link popularity. Link yang diperhitungkan adalah link standar dengan menggunakan tag .Contohnya : Situs Website Murah IndonesiaPada contoh diatas, kalimat \"Situs Website Murah Indonesia\" juga diperhitungkan, sehingga dalam kasus ini situs sevenmediateknologi.com memiliki peluang besar untuk keyword \"Website Murah\" atau \"Situs Website Murah Indonesia\" dan juga \"Situs Website Murah Indonesia\".","breadcrumb":{"@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/sevenmediatech.co.id\/2017\/03\/24\/tips-meningkatkan-posisi-website-pada-search-engine\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/sevenmediatech.co.id\/"},{"@type":"ListItem","position":2,"name":"Tips Meningkatkan Posisi Website pada Search Engine"}]},{"@type":"WebSite","@id":"https:\/\/sevenmediatech.co.id\/#website","url":"https:\/\/sevenmediatech.co.id\/","name":"Jasa Pembuatan Website dan Aplikasi Profesional","description":"","publisher":{"@id":"https:\/\/sevenmediatech.co.id\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/sevenmediatech.co.id\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/sevenmediatech.co.id\/#organization","name":"CV. Seven Media Technology","url":"https:\/\/sevenmediatech.co.id\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sevenmediatech.co.id\/#\/schema\/logo\/image\/","url":"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2023\/03\/LOGO-SMT-New-e1678874347286.png","contentUrl":"https:\/\/sevenmediatech.co.id\/wp-content\/uploads\/2023\/03\/LOGO-SMT-New-e1678874347286.png","width":300,"height":85,"caption":"CV. Seven Media Technology"},"image":{"@id":"https:\/\/sevenmediatech.co.id\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/f5fa5fc6cabf8b2c7341442e4834aa61","name":"Ardika Santosa","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/sevenmediatech.co.id\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b4cc548707cb0126e275bca86d1eed70?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b4cc548707cb0126e275bca86d1eed70?s=96&d=mm&r=g","caption":"Ardika Santosa"},"sameAs":["http:\/\/-"],"url":"https:\/\/sevenmediatech.co.id\/author\/blog-smt\/"}]}},"_links":{"self":[{"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/posts\/1944"}],"collection":[{"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/comments?post=1944"}],"version-history":[{"count":1,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/posts\/1944\/revisions"}],"predecessor-version":[{"id":2734,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/posts\/1944\/revisions\/2734"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/media\/2733"}],"wp:attachment":[{"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/media?parent=1944"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/categories?post=1944"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sevenmediatech.co.id\/wp-json\/wp\/v2\/tags?post=1944"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}